app/controllers/entries_controller.rb

  def index
    @entries = Entry.all
---
SELECT "entries".* FROM "entries"

  def create
    @entry = Entry.new(entry_params)
    @entry.user_id = params[:user_id]

    if @entry.save
---
INSERT INTO "entries" ("weight", "unit", "entry_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["weight", "104.13"], ["unit", "lb"], ["entry_date", "2000-12-06"], ["user_id", 5], ["created_at", "2020-08-17 20:35:13.657039"], ["updated_at", "2020-08-17 20:35:13.657039"]]

  def update
    if @entry.update(entry_params)
---
UPDATE "entries" SET "weight" = $1, "unit" = $2, "entry_date" = $3, "updated_at" = $4 WHERE "entries"."id" = $5  [["weight", "130.32"], ["unit", "kg"], ["entry_date", "2010-12-05"], ["updated_at", "2020-08-18 17:03:55.367272"], ["id", 5]]

  def destroy
    @entry.destroy
---
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 6]]

  def set_entry
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]