app/controllers/users_controller.rb

  def login
    user = User.find_by(username: params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Gollum"], ["LIMIT", 1]]

  def create
    puts user_params
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "Jennyyy"], ["password_digest", "$2a$12$y4vazjK/OX9v6czxo3X0q.k0ISvDslXe7Fou4MASfsjnOvgV1lCoy"], ["updated_at", "2020-08-18 17:10:26.303041"], ["id", 5]]